[
    "Today, my son asked “Can I have a book mark?” and I burst into tears. 11 years old and he still doesn't know my name is Brian.",
    "Did you know the first French fries weren't actually cooked in France? They were cooked in Greece.",
    "If a child refuses to sleep during nap time, are they guilty of resisting a rest?",
    "I'm reading a book about anti-gravity. It's impossible to put down!",
    "What do you call someone with no body and no nose? Nobody knows.",
    "I ordered a chicken and an egg from Amazon. I’ll let you know.",
    "What is the least spoken language in the world? Sign language.",
    "A slice of apple pie is $2.50 in Jamaica and $3.00 in the Bahamas. These are the pie rates of the Caribbean.",
    "Justice is a dish best served cold, if it were served warm it would be justwater.",
    "If you see a robbery at an Apple Store does that make you an iWitness?",
    "Did you hear the news? FedEx and UPS are merging. They’re going to go by the name Fed-Up from now on.",
    "Don't trust atoms. They make up everything!",
    "Why did the invisible man turn down the job offer? He couldn't see himself doing it.",
    "SERVER: “Sorry about your wait.” DAD: “Are you saying I’m fat?”",
    "CASHIER:  “Would you like the milk in a bag, sir?” DAD: “No, just leave it in the carton!”",
    "When an ambulance zips past with its siren blaring: “They won’t sell much ice cream driving that fast.”",
    "What do you call a dog that can do magic? A Labracadabrador.",
    "5/4 of people admit that they’re bad with fractions.",
    "Why couldn't the bike standup by itself? It was two tired.",
    "How many tickles does it take to make an octopus laugh? Ten-tickles.",
    "SON: *hands my Dad his 50th birthday card*, DAD: You know, one would have been enough.",
    "Can February March? No, but April May!",
    "Why did the crab never share? Because he's shellfish.",
    "You know what the loudest pet you can get is? A trumpet.",
    "What noise does a 747 make when it bounces? Boeing, Boeing, Boeing.",
    "What do you call a factory that sells passable products? A satisfactory.",
    "Why don't eggs tell jokes? They'd crack each other up."
]